In [17]:
import pandas as pd

In [19]:
friend_list = [
                ('name', ['John', 'Jenny', 'Nate']),
                ('age', [20, 30, 30]),
                ('Job', ['student', 'developer', 'teacher'])
]
df = pd.DataFrame.from_dict(dict(friend_list))

In [18]:
df[1:3]

    name  age        Job
1  Jenny   30  developer
2   Nate   30    teacher

In [5]:
df

    name  age        Job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [20]:
df=df[1:3]

In [21]:
df

    name  age        Job
1  Jenny   30  developer
2   Nate   30    teacher

In [23]:
friend_list = [
                ('name', ['John', 'Jenny', 'Nate']),
                ('age', [20, 30, 30]),
                ('Job', ['student', 'developer', 'teacher'])
]
df = pd.DataFrame.from_dict(dict(friend_list))

In [8]:
df

    name  age        Job
1  Jenny   30  developer
2   Nate   30    teacher

In [22]:
df.loc[[0,2]]

KeyError: 'Passing list-likes to .loc or [] with any missing labels is no longer supported, see https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike'

In [11]:
df=df.loc[[0,2]]

KeyError: 'Passing list-likes to .loc or [] with any missing labels is no longer supported, see https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike'

In [16]:
df

   name  age      Job
0  John   20  student
2  Nate   30  teacher

In [15]:
friend_list = [
                ('name', ['John', 'Jenny', 'Nate']),
                ('age', [20, 30, 30]),
                ('Job', ['student', 'developer', 'teacher'])
]
df = pd.DataFrame.from_dict(dict(friend_list))

In [18]:
df

    name  age        Job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

### by column condition

In [21]:
df[df.age>25]

    name  age        Job
1  Jenny   30  developer
2   Nate   30    teacher

In [22]:
df.query('age>25')

    name  age        Job
1  Jenny   30  developer
2   Nate   30    teacher

In [29]:
df[(df.age>25)&(df.name=="Nate")]

   name  age      Job
2  Nate   30  teacher

## Filter Column

### by index

In [31]:
friend_list=[
    ['John',20,'student'],
    ['Jenny',30,'developer'],
    ['Nate',30,'teacher']
]
df=pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [32]:
df.iloc[:,0:2]

       0   1
0   John  20
1  Jenny  30
2   Nate  30

In [33]:
df.iloc[0:2,0:2]

       0   1
0   John  20
1  Jenny  30

## by column name

In [35]:
df=pd.read_csv('C:\\Pandas\\friend_list_no_head.csv',header=None,names=['name','age','job'])

In [36]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45     manage
5  Chris   25     intern

In [37]:
df_filtered=df[['name','age']]

In [39]:
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [41]:
df.filter(items=['age','job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45     manage
5   25     intern

In [51]:
df.filter(like='a',axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [47]:
df.filter(regex='b$',axis=1)

         job
0    student
1  developer
2    teacher
3    dentist
4     manage
5     intern

In [12]:
df.filter(regex='b$',axis=1)

         Job
1  developer
2    teacher